k6_script/redis_load_test.yml
config:
  target: "http://host.docker.internal:8080"
  phases:
    - duration: 30
      arrivalRate: 50
    - duration: 30
      arrivalRate: 100
    - duration: 10
      arrivalRate: 0
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    influxdb:
      test: "redis_test"
      instance: "http://host.docker.internal:8086"
      database: "k6"
      username: "dummy"
      password: "dummy"

scenarios:
  - name: "redis_test"
    flow:
      - get:
          url: "/api/class/35"
          capture:
            - json: "$.status"
              as: "status"
          expect:
            - statusCode: 200
      - think: 1